---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeTable.GetValues
source: html/587f0370-2949-d83f-7d9a-dd6d11454741.htm
---
# Autodesk.Revit.DB.ExportLinetypeTable.GetValues Method

Returns all the values stored in the map.

## Syntax (C#)
```csharp
public IList<ExportLinetypeInfo> GetValues()
```

## Returns
The info.